print ("Name: %s, age: %d" % ('John', 35)) 

# http://pythoncentral.io/pythons-range-function-explained/
d01=['---','正常','磨損','無法修復']
d02=['---','正常','磨損','裂縫','磨損、裂縫']
d03=['---','正常','平面變型','無法修復']
d04=['---','正常','平面變型','無法修復']
d05=['---','正常','合模缸漏油','合模缸螺旋斷裂','合模活塞磨損','無法修復']
d06=['---','正常','磨損','無法修復']
d07=['---','正常','磨損','斷裂','無法修復']
d08=['---','正常','開關損壞','線路不通','無法修復']
d09=['---','正常','無壓力','線路不通','壓射缸漏油','射杆彎曲']
d10=['---','正常','斷線','短路','鏈條斷','編碼器異常','銅套磨損']
d11=['---','正常','磨損','斷裂','接頭滑絲']
d12=['---','正常','破損','堵塞']
d13=['---','正常','油品變質']
d14=['---','正常','磨損','軸心斷裂']
d15=['---','正常','線路不通','閥心斷裂']
d16=['---','正常','管道不通','管道斷裂','泵心磨損']
d17=['---','正常','鋼瓶裂縫','壓力過高','壓力過低']
d18=['---','正常','線路不通','短路']
d19=['---','正常','霧化器損壞','線路不通','緩衝彈簧斷裂']
d20=['---','正常','開關損壞','軸承磨損','緩衝器斷裂','線路不通','編碼器異常']
d21=['---','正常','尺寸NG','模崩','模芯斷','重覆修模','待修模']
    # CHOICE03=(
    #     ('---','---'),
    #     ('正常','正常'),
    #     ('平面變型','平面變型'),
    #     ('裂縫 ','裂縫'),
    #     ('無法修復','無法修復'),
    # )
d00=['']
dlist=[d00,d01,d02,d03,d04,d05,d06,d07,d08,d09,d10,d11,d12,d13,d14,d15,d16,d17,d18,d19,d20,d21]

# http://stackoverflow.com/questions/22617/format-numbers-to-strings-in-python
# xxx="MM/DD/YY = {0:02d}/{1:02d}/{2:02d}".format(12, 7, 41) 
    
for i in range(1, len(dlist)):
    str_items = "    CHOICE{0:02d} = (\n".format(i)
    for item in dlist[i]:
        str_items += "        ('"+item+"','"+item+"'),\n"
    str_items +="    )\n"
    


    print (str_items)
    # print (yyy, dlist[i])